[
  {
    "id": "chief-growth-officer",
    "title": "Chief Growth Officer",
    "description": "We're looking for a Chief Growth Officer to lead our AI-powered transformation agenda across Southeast Asia. This is not your typical sales leadership gig. You'll be working at the edge of enterprise AI, partnering with CXOs of the region's biggest brands to turn cutting-edge tech into real business outcomes. If you thrive where business meets technology, and if you're ready to shape the future of GTM in the AI era — this is your shot.",
    "type": "Full-time",
    "experience": "8–10 Years of Experience",
    "location": "Singapore / Bali (Hybrid)",
    "whatYouWillOwn": [
      "**Strategic Growth Leadership**: Lead the overall go-to-market strategy across Southeast Asia, driving revenue growth and market expansion through enterprise AI adoption.",
      "**Executive Relationship Building**: Partner directly with C-suite executives at leading brands to understand their business challenges and architect transformative AI solutions.",
      "**Revenue & Pipeline Management**: Own revenue targets, build and manage a high-performing sales pipeline, and drive deal closure with enterprise clients.",
      "**Market Intelligence**: Stay ahead of AI trends, competitive landscape, and customer needs to position CalvinBall as the leading vertical AI platform in the region."
    ],
    "idealProfile": [
      "8-10+ years of experience in enterprise sales, business development, or growth leadership roles",
      "Proven track record of selling complex B2B technology solutions to C-level executives",
      "Deep understanding of AI/ML technologies and their business applications",
      "Strong network across Southeast Asian enterprise ecosystem",
      "Excellent storytelling and presentation skills",
      "Experience building and scaling GTM teams"
    ],
    "calvinballerVibes": [
      "**Visionary closer**. You see the big picture and make it happen.",
      "**Relationship architect**. You build trust and partnerships that last.",
      "**AI-fluent**. You speak both business and technology fluently.",
      "**Growth hacker mindset**. You're creative, resourceful, and results-driven."
    ]
  },
  {
    "id": "operations-assistant-manager",
    "title": "Operations Assistant Manager",
    "description": "We're looking for a proactive, detail-obsessed operator to serve as the administrative engine of our operations. You'll be the anchor that keeps things structured and on track - managing documentation, coordinating vendors and clients, maintaining financial records, and ensuring nothing operational ever becomes a bottleneck. This role is the backbone of our operational machine - for someone who thrives on process, precision, and getting things done.",
    "type": "Full-time",
    "experience": "3–7 Years of Experience",
    "location": "Bali, Indonesia (Hybrid/On-site)",
    "whatYouWillOwn": [
      "**Business Operations Execution**: Manage business administrative tasks including vendor registrations, client documentation, and coordination of enterprise processes such as master document management. Act as the central point of contact for clients' operational and administrative requirements, and lead scheduling and coordination between clients and the internal business team to ensure seamless communication and execution.",
      "**Finance Operations Execution**: Support finance operations by maintaining accurate invoice and payment records, ensuring timely issuance of client invoices, assisting with procurement documentation, handling day-to-day bookkeeping activities in collaboration with the accounting team, and tracking internal expense reports and reimbursements.",
      "**People Operations Execution**: Support people-related administrative workflows including onboarding documentation, leave tracking, internal HR files, and compliance logs. Coordinate scheduling, records, and communications across team milestones such as new joiner setup, exit formalities, and contractor paperwork. Ensure people operations processes are smooth, organized, and up-to-date.",
      "**Process Improvement & Operational Excellence**: Continuously enhance administrative systems and workflows, identify inefficiencies proactively, and uphold high standards of accuracy, discretion, and execution across all operational support activities."
    ],
    "idealProfile": [
      "3-7 years of experience in admin, finance ops, operations administration, or similar role",
      "Ultra-organized, with a sharp eye for details and timelines",
      "Skilled in Google Workspace, Excel/Sheets, and task tracking tools",
      "Clear communicator in English, both written and spoken",
      "Comfortable working cross-functionally with internal teams and external parties",
      "Fast-paced startup savvy – able to juggle multiple threads without dropping any"
    ],
    "calvinballerVibes": [
      "**Admin anchor**. You're the calm, structured force that keeps everything running.",
      "**Process ninja**. You improve systems, not just follow them.",
      "**Discreet and dependable**. Trusted with sensitive info and always sharp on delivery.",
      "**Execution-first**. You move fast, get it right, and make sure no ball gets dropped."
    ]
  },
  {
    "id": "video-editor-motion-graphics",
    "title": "Video Editor & Motion Graphics",
    "description": "We're looking for a high-performance video editor who can turn raw, fast-moving inputs into polished, high-impact outputs - fast. At CalvinBall Technologies, videos are more than just content – they're strategic tools that drive engagement, explain complex concepts, and build our brand narrative.",
    "type": "Full-time",
    "experience": "5–7 Years of Experience",
    "location": "Bali / Remote",
    "whatYouWillOwn": [
      "**Video Production & Editing**: Transform raw footage into compelling video content across product demos, customer testimonials, marketing campaigns, and social media.",
      "**Motion Graphics & Animation**: Create engaging motion graphics, animated explainers, and visual effects that simplify complex AI concepts.",
      "**Brand Consistency**: Ensure all video content aligns with CalvinBall's brand identity and visual language.",
      "**Rapid Turnaround**: Work in a fast-paced environment, delivering high-quality outputs on tight timelines while maintaining creative excellence."
    ],
    "idealProfile": [
      "5-7 years of professional video editing and motion graphics experience",
      "Expert in Adobe Premiere Pro, After Effects, and related tools",
      "Strong portfolio demonstrating range across corporate, social, and brand content",
      "Experience with AI/tech product marketing (preferred)",
      "Excellent sense of pacing, storytelling, and visual composition",
      "Ability to work independently and manage multiple projects simultaneously"
    ],
    "calvinballerVibes": [
      "**Visual storyteller**. You turn ideas into compelling narratives.",
      "**Fast executor**. Quality at speed is your superpower.",
      "**Creative problem-solver**. You find innovative solutions under constraints.",
      "**Brand champion**. You're obsessed with making every frame count."
    ]
  },
  {
    "id": "brand-community-lead",
    "title": "Brand & Community Lead",
    "description": "We're looking for a Brand & Community Lead to shape and amplify Calvinball Tech's voice across every channel and conversation. You'll be the builder behind our public narrative – turning bold ideas into compelling stories that resonate with our audience and drive meaningful engagement.",
    "type": "Full-time",
    "experience": "7–10 Years of Experience",
    "location": "Singapore / Bali (Hybrid)",
    "whatYouWillOwn": [
      "**Brand Strategy & Positioning**: Define and evolve CalvinBall's brand narrative, messaging, and positioning in the AI space.",
      "**Community Building**: Build and nurture engaged communities across social media, events, and digital channels.",
      "**Content Strategy**: Lead content creation across blog posts, social media, thought leadership, and marketing campaigns.",
      "**Events & Partnerships**: Organize and manage events, webinars, and strategic partnerships that amplify brand presence."
    ],
    "idealProfile": [
      "7-10 years of experience in brand marketing, community management, or related roles",
      "Proven track record building brands in tech/SaaS/AI space",
      "Exceptional writing and storytelling skills",
      "Experience managing social media strategy and community platforms",
      "Strong understanding of B2B marketing and enterprise audiences",
      "Data-driven mindset with ability to measure and optimize engagement"
    ],
    "calvinballerVibes": [
      "**Brand architect**. You craft narratives that stick and resonate.",
      "**Community builder**. You turn audiences into advocates.",
      "**Storytelling pro**. Every post, every word has purpose.",
      "**Culture maker**. You shape how the world sees CalvinBall."
    ]
  },
  {
    "id": "senior-product-manager",
    "title": "Senior Product Manager",
    "description": "We're looking for a Senior Product Manager to lead the design and execution of next-generation AI agents that power enterprise workflows across marketing, sales, and analytics. This isn't a traditional product role – you'll be working at the intersection of AI, enterprise software, and user experience.",
    "type": "Full-time",
    "experience": "10–15 Years of Experience",
    "location": "Singapore / Bali (Hybrid)",
    "whatYouWillOwn": [
      "**Product Vision & Strategy**: Define product roadmap and strategy for AI agents, balancing innovation with customer needs and business goals.",
      "**AI Product Development**: Work closely with engineering and AI teams to design and ship intelligent agent capabilities.",
      "**Customer Discovery**: Conduct deep customer research to understand enterprise workflows and identify opportunities for AI automation.",
      "**Cross-functional Leadership**: Lead product development across engineering, design, and GTM teams to deliver exceptional user experiences."
    ],
    "idealProfile": [
      "10-15 years of product management experience, preferably in B2B SaaS or AI/ML products",
      "Deep understanding of AI/LLM technologies and their practical applications",
      "Strong track record shipping complex enterprise products",
      "Excellent analytical and strategic thinking skills",
      "Experience working with engineering teams in agile environments",
      "Outstanding communication and stakeholder management abilities"
    ],
    "calvinballerVibes": [
      "**Product visionary**. You see where AI is going and build for it.",
      "**Customer champion**. User needs drive every decision you make.",
      "**Technical collaborator**. You speak engineer and can dive deep.",
      "**Execution machine**. You ship products that users love."
    ]
  }
]
